# St7SetCombinationEnvelopeCase

Sets the state of the specified results case in a combination envelope for the currently open solution.

long St7SetCombinationEnvelopeCase(long uID, long Envelope, long CaseNum,
long State)
Input Parameters
uID
Strand7 model file ID.
Envelope
Combination envelope number.
CaseNum
Result case number.
State
One of esCombEnvelopeOn, esCombEnvelopeOff or esCombEnvelopeCheck.